Revit 2026 API

# UniqueElementFailures Properties

---

The BuiltInFailuresUniqueElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ProhibitUniqueElementDeletion | Internal setting '%1!s!' is required by Revit and has been deleted. |

#### Reference

BuiltInFailuresUniqueElementFailures Class

Autodesk.Revit.DB Namespace